import {
    SectionPolitics,
    ShortText,
    ListRules,
    ItemRule,
    LinkEdit,
    DataPublic,
    CenterPolitics,
    BoxPolitics,
} from "./Politics.styled";
import HeaderMenuPageHome from "./../PageHome/HeaderPageHome/HeaderMenu/HeaderMenuPageHome";
import FooterPageHome from "./../PageHome/FooterPageHome/FooterPageHome";

const Politics = () => {
    return (
        <>
            <SectionPolitics>
                <CenterPolitics>
                    <HeaderMenuPageHome />
                    <BoxPolitics>
                        <ShortText>
                            Настоящий документ «Политика конфиденциальности»
                            (далее – по тексту – «Политика») представляет собой
                            правила использования сайтом - dip.baby. Владелец
                            сайта (далее – Администрация) персональной
                            информации Пользователя, которую Администрац ия,
                            включая всех лиц, входящих в одну группу с
                            Администрацией, могут получить о Пользователе во
                            время использования им любого из сайтов, сервисов,
                            служб, программ, продуктов или услуг Администрации
                            (далее – Сайта) и в ходе исполнения Администрацией
                            любых соглашений и договоров с Пользователем.
                            Согласие Пользователя с Политикой, выраженное им в
                            рамках отношений с одним из перечисленных лиц,
                            распространяется на все остальные перечисленные
                            лица. Использование Сайта означает безоговорочное
                            согласие Пользователя с настоящей Политикой и
                            указанными в ней условиями обработки его
                            персональной информации; в случае несогласия с этими
                            условиями Пользователь должен воздержаться от
                            использования Сайта.
                        </ShortText>
                        <ListRules>
                            <ItemRule>
                                Общие положения политики
                                <ListRules>
                                    <ItemRule>
                                        Настоящая Политика составлена в
                                        соответствии с Законом Украины «О защите
                                        персональных данных» № 2297-VI от 01
                                        июля 2010 г.», а также иными
                                        нормативно-правовыми актами Украины в
                                        области защиты и обработки персональных
                                        данных и действует в отношении всех
                                        персональных данных, которые Оператор
                                        может получить от Пользователя,
                                        являющегося стороной по
                                        гражданско-правовому договору.
                                    </ItemRule>
                                    <ItemRule>
                                        Администрация имеет право вносить
                                        изменения в настоящую Политику. При
                                        внесении изменений в заголовке Политики
                                        указывается дата последнего обновления
                                        редакции. Новая редакция Политики
                                        вступает в силу с момента ее размещения
                                        на сайте, если иное не предусмотрено
                                        новой редакцией Политики.
                                    </ItemRule>
                                </ListRules>
                            </ItemRule>
                            <ItemRule>
                                Персональная информация Пользователей, которую
                                обрабатывает Сайт
                                <ListRules>
                                    <ItemRule>
                                        . Под персональной информацией в
                                        настоящей Политике понимается:
                                        <ListRules>
                                            <ItemRule>
                                                Информация, предоставляемая
                                                Пользователем самостоятельно при
                                                регистрации (создании учётной
                                                записи) или в процессе
                                                использования Сайта, включая
                                                персональные данные
                                                Пользователя. Обязательная для
                                                предоставления Сайтом информация
                                                помечена специальным образом.
                                                Иная информация предоставляется
                                                Пользователем на его усмотрение;
                                            </ItemRule>
                                            <ItemRule>
                                                Данные, которые передаются в
                                                автоматическом режиме Сайту в
                                                процессе их использования с
                                                помощью установленного на
                                                устройстве Пользователя
                                                программного обеспечения, в том
                                                числе IP-адрес, данные файлов
                                                cookie, информация о браузере
                                                Пользователя (или иной
                                                программе, с помощью которой
                                                осуществляется доступ к Сайту),
                                                технические характеристики
                                                оборудования и программного
                                                обеспечения, используемых
                                                Пользователем, дата и время
                                                доступа к Сайту, адреса
                                                запрашиваемых страниц и иная
                                                подобная информация;
                                            </ItemRule>
                                            <ItemRule>
                                                Иная информация о Пользователе,
                                                обработка которой предусмотрена
                                                условиями использования Сайта.
                                            </ItemRule>
                                        </ListRules>
                                    </ItemRule>
                                    <ItemRule>
                                        Настоящая Политика применима только к
                                        информации, обрабатываемой в ходе
                                        использования Сайта. Сайт не
                                        контролирует и не несет ответственность
                                        за обработку информации сайтами третьих
                                        лиц, на которые Пользователь может
                                        перейти по ссылкам, доступным на Сайте.
                                    </ItemRule>
                                    <ItemRule>
                                        Сайт не проверяет достоверность
                                        персональной информации, предоставляемой
                                        Пользователем, и не имеет возможности
                                        оценивать его дееспособность.
                                    </ItemRule>
                                </ListRules>
                            </ItemRule>
                            <ItemRule>
                                . Цели обработки персональной информации
                                Пользователей
                                <ListRules>
                                    <ItemRule>
                                        Сайт собирает и хранит только ту
                                        персональную информацию, которая
                                        необходима для предоставления сервисов
                                        или исполнения соглашений и договоров с
                                        Пользователем, за исключением случаев,
                                        когда законодательством предусмотрено
                                        обязательное хранение персональной
                                        информации в течение определенного
                                        законом срока.
                                    </ItemRule>
                                    <ItemRule>
                                        Персональную информацию Пользователя
                                        Сайт обрабатывает в следующих целях:
                                        <ListRules>
                                            <ItemRule>
                                                Идентификация стороны в рамках
                                                сервисов, соглашений и договоров
                                                с Сайтом;
                                            </ItemRule>
                                            <ItemRule>
                                                Предоставление Пользователю
                                                персонализированных сервисов и
                                                услуг, а также исполнение
                                                соглашений и договоров
                                            </ItemRule>
                                            <ItemRule>
                                                Направление уведомлений,
                                                запросов и информации,
                                                касающихся использования Сайта,
                                                исполнения соглашений и
                                                договоров, а также обработка
                                                запросов и заявок от
                                                Пользователя;
                                            </ItemRule>
                                            <ItemRule>
                                                Улучшение качества работы Сайта,
                                                удобства его использования для
                                                Пользователя, разработка новых
                                                услуг и сервисов;
                                            </ItemRule>
                                            <ItemRule>
                                                Таргетирование рекламных
                                                материалов;
                                            </ItemRule>
                                            <ItemRule>
                                                Проведение статистических и иных
                                                исследований на основе
                                                обезличенных данных.
                                            </ItemRule>
                                        </ListRules>
                                    </ItemRule>
                                </ListRules>
                            </ItemRule>
                            <ItemRule>
                                Условия обработки персональной информации
                                Пользователей и её передачи третьим лицам
                                <ListRules>
                                    <ItemRule>
                                        В отношении персональной информации
                                        Пользователя сохраняется ее
                                        конфиденциальность, кроме случаев
                                        добровольного предоставления
                                        Пользователем информации о себе для
                                        общего доступа неограниченному кругу
                                        лиц.
                                    </ItemRule>
                                    <ItemRule>
                                        Сайт вправе передать персональную
                                        информацию Пользователя третьим лицам в
                                        следующих случаях:
                                    </ItemRule>
                                    <ItemRule>
                                        <ListRules>
                                            <ItemRule>
                                                Пользователь выразил согласие на
                                                такие действия;
                                            </ItemRule>
                                            <ItemRule>
                                                Передача необходима для
                                                использования Пользователем
                                                определенного сервиса либо для
                                                исполнения определенного
                                                соглашения или договора с
                                                Пользователем;
                                            </ItemRule>
                                            <ItemRule>
                                                Передача необходима для
                                                функционирования и
                                                работоспособности самого Сайта;
                                            </ItemRule>
                                            <ItemRule>
                                                Передача предусмотрена
                                                украинским или иным применимым
                                                законодательством в рамках
                                                установленной законодательством
                                                процедуры;
                                            </ItemRule>
                                            <ItemRule>
                                                Такая передача происходит в
                                                рамках продажи или иной передачи
                                                бизнеса (полностью или в части),
                                                при этом к приобретателю
                                                переходят все обязательства по
                                                соблюдению условий настоящей
                                                Политики применительно к
                                                полученной им персональной
                                                информации;
                                            </ItemRule>
                                            <ItemRule>
                                                В целях обеспечения возможности
                                                защиты прав и законных интересов
                                                Сайта или третьих лиц в случаях,
                                                когда Пользователь нарушает
                                                Пользовательское соглашение
                                                Сайта, настоящую Политику, либо
                                                документы, содержащие условия
                                                использования конкретных
                                                сервисов.
                                            </ItemRule>
                                            <ItemRule>
                                                В результате обработки
                                                персональной информации
                                                Пользователя путем ее
                                                обезличивания получены
                                                обезличенные статистические
                                                данные, которые передаются
                                                третьему лицу для проведения
                                                исследований, выполнения работ
                                                или оказания услуг по поручению
                                                Сайта.
                                            </ItemRule>
                                        </ListRules>
                                    </ItemRule>
                                </ListRules>
                            </ItemRule>
                            <ItemRule>
                                Изменение и удаление персональной информации.
                                Обязательное хранение данных
                                <ListRules>
                                    <ItemRule>
                                        Пользователь может в любой момент
                                        изменить (обновить, дополнить)
                                        предоставленную им персональную
                                        информацию или её часть, обратившись к
                                        Сайту по контактам в разделе «Контакты».
                                    </ItemRule>
                                    <ItemRule>
                                        Права, предусмотренные п. 5.1. настоящей
                                        Политики могут быть ограничены в
                                        соответствии с требованиями
                                        законодательства. Например, такие
                                        ограничения могут предусматривать
                                        обязанность Сайта сохранить измененную
                                        или удаленную Пользователем информацию
                                        на срок, установленный
                                        законодательством, и передать такую
                                        информацию в соответствии с
                                        законодательно установленной процедурой
                                        государственному органу.
                                    </ItemRule>
                                </ListRules>
                            </ItemRule>
                            <ItemRule>
                                Обработка персональной информации при помощи
                                файлов Cookie и счетчиков
                                <ListRules>
                                    <ItemRule>
                                        Файлы cookie, передаваемые Сайтом
                                        оборудованию Пользователя и
                                        оборудованием Пользователя Сайту, могут
                                        использоваться Сайтом для предоставления
                                        Пользователю персонализированных
                                        сервисов, для таргетирования рекламы,
                                        которая показывается Пользователю, в
                                        статистических и исследовательских
                                        целях, а также для улучшения Сайта.
                                    </ItemRule>
                                    <ItemRule>
                                        Пользователь осознает, что оборудование
                                        и программное обеспечение, используемые
                                        им для посещения сайтов в сети интернет
                                        могут обладать функцией запрещения
                                        операций с файлами cookie (для любых
                                        сайтов или для определенных сайтов), а
                                        также удаления ранее полученных файлов
                                        cookie.
                                    </ItemRule>
                                    <ItemRule>
                                        Поисковая система вправе установить, что
                                        предоставление определенного сервиса или
                                        услуги возможно только при условии, что
                                        прием и получение файлов cookie
                                        разрешены Пользователем.
                                    </ItemRule>
                                    <ItemRule>
                                        Структура файла cookie, его содержание и
                                        технические параметры определяются
                                        Сайтом и могут изменяться без
                                        предварительного уведомления
                                        Пользователя.
                                    </ItemRule>
                                    <ItemRule>
                                        Счетчики, размещенные Сайтом, могут
                                        использоваться для анализа файлов cookie
                                        Пользователя, для сбора и обработки
                                        статистической информации об
                                        использовании Сайта, а также для
                                        обеспечения работоспособности Сайта в
                                        целом или их отдельных функций в
                                        частности. Технические параметры работы
                                        счетчиков определяются Сайтом и могут
                                        изменяться без предварительного
                                        уведомления Пользователя.
                                    </ItemRule>
                                </ListRules>
                            </ItemRule>
                            <ItemRule>
                                Защита персонально информации Пользователя
                                <ListRules>
                                    <ItemRule>
                                        Сайт предпринимает необходимые и
                                        достаточные организационные и
                                        технические меры для защиты персональной
                                        информации Пользователя от
                                        неправомерного или случайного доступа,
                                        уничтожения, изменения, блокирования,
                                        копирования, распространения, а также от
                                        иных неправомерных действий с ней
                                        третьих лиц.
                                    </ItemRule>
                                </ListRules>
                            </ItemRule>
                            <ItemRule>
                                Изменение Политики конфиденциальности
                                <ListRules>
                                    <ItemRule>
                                        Сайт имеет право вносить изменения в
                                        настоящую Политику конфиденциальности.
                                        При внесении изменений в актуальной
                                        редакции указывается дата последнего
                                        обновления. Новая редакция Политики
                                        вступает в силу с момента ее размещения,
                                        если иное не предусмотрено новой
                                        редакцией Политики. Действующая редакция
                                        постоянно доступна на странице по адресу
                                        <LinkEdit href="https://dip.baby">
                                            https://dip.baby
                                        </LinkEdit>
                                    </ItemRule>
                                </ListRules>
                            </ItemRule>
                            <ItemRule>
                                Контакты и вопросы по персональным данным
                                <ListRules>
                                    <ItemRule>
                                        Все предложения, вопросы, запросы и иные
                                        обращения по поводу настоящей Политики и
                                        использования своих персональных данных
                                        Пользователь вправе направлять Сайту:
                                        <br />
                                        <br />- по адресу электронной почты:
                                        dip.baby.game@gmail.com
                                    </ItemRule>
                                </ListRules>
                            </ItemRule>
                        </ListRules>
                        <DataPublic>Дата публикации: 01.01.2022 г.</DataPublic>
                    </BoxPolitics>
                </CenterPolitics>
            </SectionPolitics>
            <FooterPageHome />
        </>
    );
};

export default Politics;
